#Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.

# n=input("Введите число N=")
# num=str((n)) 

# sum=int(0) 
# for i in num:
#     if i!=".":
#         sum+=int(i)
# print(sum)
  
# n=input("Введите число N=")
# num=str((n)) 

# sum=int(0)

# for i in num:
#     print(i.isdigit())
#     if i.isdigit():
#         sum+=int(i)
    
# print(sum)

    
